{
  "meta": {
    "status": 200,
    "msg": "OK"
  },
  "response": {
    "total_blogs": 237,
    "blogs": [
      {
        "name": "hotcumpublicoutdoor",
        "title": "Hot Cum Public Outdoor",
        "description": "Fantasies 😜",
        "url": "https://hotcumpublicoutdoor.tumblr.com/",
        "updated": 1495466017
      },
      {
        "name": "brosnohomo",
        "title": "Just straight bros naked nothing gay",
        "description": "",
        "url": "https://brosnohomo.tumblr.com/",
        "updated": 1495600708
      },
      {
        "name": "yolofolife001",
        "title": "Real Amateur",
        "description": "<p>I post or reblog real amateur stuff. Not those professional or pretending to be amateur crap. Submissions welcome.</p>",
        "url": "https://yolofolife001.tumblr.com/",
        "updated": 1463170582
      },
      {
        "name": "flasherdudenyc",
        "title": "FLASHERDUDENYC",
        "description": "If you're in NYC, hit me up and let's fuck. Total sex-addicted pervert. Public. Incest. Groups. Piss. Gooning. Thumbsucking. Boys. Daddys. Niggers. Cucks. Chicks. Sissys. Jocks. Profile pic is not me. Snap is flasherdude. Email is flasherdudenyc@aol.com",
        "url": "http://flasherdudenyc.tumblr.com/",
        "updated": 1495944013
      },
      {
        "name": "onceknownasjake",
        "title": "once known as jake",
        "description": "<p>just an average aussie guy, into guys. 28, uncut, always horny - submit - north queensland australia</p>",
        "url": "https://onceknownasjake.tumblr.com/",
        "updated": 1495980792
      },
      {
        "name": "bennyoutside-only",
        "title": "BENNYOUTSIDE-ONLY",
        "description": "MAIN TUMBLR：\nbenny-outside.tumblr.com 微信Wechat：1696601884 \n\nORIGENAL BLOG",
        "url": "https://bennyoutside-only.tumblr.com/",
        "updated": 1495378199
      },
      {
        "name": "filthyandhorny",
        "title": "Horny Pig",
        "description": "<p>None of the pics are mine,unless stated</p>",
        "url": "http://filthyandhorny.tumblr.com/",
        "updated": 1495989185
      },
      {
        "name": "chavliammate",
        "title": "Chavs, thugs, Cars",
        "description": "",
        "url": "https://chavliammate.tumblr.com/",
        "updated": 1495953972
      },
      {
        "name": "xy-hih",
        "title": "FuckH",
        "description": "暴露，SM，互，南京",
        "url": "https://xy-hih.tumblr.com/",
        "updated": 1495893972
      },
      {
        "name": "indecentexpo",
        "title": "Indecent Exposure",
        "description": "Hey guys. This is just a blog mainly dedicated to naked guys usually in public, so it's NSFW. That being said, you must be 18 or older to view. Anyways, enjoy...",
        "url": "http://indecentexpo.tumblr.com/",
        "updated": 1495902133
      },
      {
        "name": "masturbatingmen4you",
        "title": "MASTURBATING MEN",
        "description": "Because There's Nothing Hotter Than Watching A Beautiful Man MASTURBATING His Penis.",
        "url": "https://masturbatingmen4you.tumblr.com/",
        "updated": 1494334365
      },
      {
        "name": "gaypublicwank",
        "title": "Gay Public Fun",
        "description": "<p>Love gay exhibitionism and voyeurism, taboo, everything!</p>",
        "url": "https://gaypublicwank.tumblr.com/",
        "updated": 1495983527
      },
      {
        "name": "mog78",
        "title": "Public Jerkbuddy",
        "description": "<p>from berlin. so much into public wankdates, bathroom, park, car, anywhere ... pics/vids show mostly me. 18+/21+ only!</p>",
        "url": "https://mog78.tumblr.com/",
        "updated": 1495971189
      },
      {
        "name": "guysfromtheinterwebs",
        "title": "Guys From The Interwebs",
        "description": "Guys with Phones, Guys with Cameras, Men with Phones, Men with Cameras.",
        "url": "http://guysfromtheinterwebs.tumblr.com/",
        "updated": 1483713924
      },
      {
        "name": "somepublicfun",
        "title": "Some Public Fun",
        "description": "18+ only!Everything Public!I'm 23 in the northern Chicago area!Don't Be Afraid To Show Yours Off! Snapchat: SomePublicFun",
        "url": "http://somepublicfun.tumblr.com/",
        "updated": 1495894201
      },
      {
        "name": "actionbuddy",
        "title": "ActionBuddy",
        "description": "NSFW! . NO MINORS! - Be of Legal Age of Consent for your location to follow my blog or view its posts. Leave now if you are not of legal age, or offended by images of penises, and men masturbating them. \n\nAlso, this blog is not \"safe\" for strict, closed-minded heterosexuals, or ignorant racists of any kind!\n\nThe material appearing in this blog was all found on the Internet, mostly reblogged from other Tumblr blogs, and assumed to be in the public domain. I claim no credit for the pictures or videos posted on this blog. No copyrights infringements intended. If you own an image or video that you see here, and would like me to remove it, whether or not it is copyrighted, please contact me to let me know, and I will do so immediately. \n\nThis blog is for and about ADULT males, and is focused on the pleasures of male masturbation. Interesting, sexy, preferably amateur, \"quality\" pics and videos, rather than \"quantity\"... Leave now if that does not appeal to you. The captions are 99% fictional, if not delusional, and are meant to inspire or entertain you. Quality over quantity.\n\nNONE OF THE PHOTOS OR VIDEOS ARE OF ME, other than my Levi's 501's crotch-shot Avatar pic. Please, only submit your own, personal, pics.\n\nMy blog champions the acts and enjoyment of male masturbation, frottage, and mutual masturbation amongst friendly men, as a sexual preference... Featuring amateur, as well as iconic images of natural, intact, unshaven, well-hung men of all ages (18+), and videos of horny guys playing with their own cocks, and mutually with their horny friends... Expect \"quality\" over \"quantity\".\n\nNot just another boring pretty-faced/butt-fuck blog... Click on my Archive, and find some great male masturbation pics and videos. My aesthetic seems to be working for over  54,500+ Tumblr Followers and many more that keep it bookmarked.\n\nDoing my best, daily, to bring an end to the horrid malpractice of infant circumcision, and the scourge of the pube-shaving fad!\n\nActionBuddy likes:  Cock-proud men, foreskins, full-on frottage, unshaven bush,  precum, facials, mutual masturbation, and circle jerks. My blog is about sharing  powerful male sexual energy, without degrading one another, or \"hiding the sausage\"... But, I also appreciate hot butts! Also, I post things that make me laugh, or awestruck, and often write tongue-in-cheek captions for them. Expect social commentary. \n\nBi-sexual?... Yes, I like both men AND lads... (18 y.o. and up!)... Young to mature, smooth to hairy, lean to beefy... it's all good on my couch. Intact and unshaven is what appeals to me the most. \n\nAll races and \"types\" appreciated, so, if you are a bigot, go elsewhere!  I post sexy pics and videos of men of all  types, races, ages, and sizes, in the act of enjoying their awesome cocks, or each others', mutually as friends, and in groups. Hot sex is about joy, not derogation.\n\nSeeking out non-commercial, amateur videos and pics of men and lads jacking off together, real life dad and son, brother and brother, uncle and nephew videos, and non-anal male-on-male bukkake.\n\nI prefer natural, unshaven guys that just like to show off, and don't give a fuck what their hair looks like when they are jackin' their meat.  Outdoor or public scenes, and real-life messy bedrooms are way more appealing to me than fancy, tidy, interior decorator abodes preferred by the gay porn industry. I believe that \"flawlessness\" is overrated, and perfectionism is a mental illness!... Think about it.\n\nOn that line, I'm not much into Porn Stars, especially with their overly-coiffed hair and sadly, missing pubes. Those fake, pouty-lipped, come-hither, perfectly unattainable model pics that you see 1,000's reblog every day, bore me to death. I'll rarely watch or reblog the typical porn industry \"top and bottom\" flicks with endless butt-fuck scenes mired by ridiculous amounts of phony moaning and dialog. Those \"gay-for-pay, \"thugs\", and fake \"broke-straight-guys\" genres, are kinda a yawn these days, but, will reblog some if they get me hard.\n\nLarge, uncut, unshaven cocks grab my attention first... Can't deny that!.... I prefer mutual masturbation, and frottage, more than penetrative sex. Seeking images of men masturbating with each other, and rubbing their cocks on each other, more than oral and anal sex.  I'm especially interested in guys that have fun, proudly showing off their cocks, and masturbation techniques, unhurried, with buddies, or on their webcams.\n\nCam2cam is a great thing... It's a new Sexual Revolution!... Nobel Peace Prize for the inventors of the Webcam!\n\nMy posts and reblogs will reflect my preference for imaginative, free-will, QUALITY, amateur smut.  Only interested in consensual sexual material. \n\nYou are welcome to send me messages, pics and videos here or via email at :\n \nactionbuddy@gmail.com\n\nNatural, intact, unshaven cocks preferred! Sorry, I no longer publish submissions with shaved crotches... Grow 'em back and try again!\n\nI hope my Tumblr makes your cock hard, and my comments make you chuckle, or say \"Ah-men!\"!\n\nActionBuddy",
        "url": "http://actionbuddy.tumblr.com/",
        "updated": 1495972941
      },
      {
        "name": "footballersheaven",
        "title": "Footballers Heaven",
        "description": "Questions: curiouscat.me/footballersheaven \nThe BEST tumblr for footballers and lockerroom's addicts. Got hot vids/pics of footballers? Share it!",
        "url": "http://footballersheaven.tumblr.com/",
        "updated": 1495579081
      },
      {
        "name": "metrocrush",
        "title": "Metro Crush",
        "description": "<p>Hot dudes on the Paris Metro. PLEASE SUBMIT!!</p>",
        "url": "http://metrocrush.tumblr.com/",
        "updated": 1495732469
      },
      {
        "name": "spyvoyeur4all",
        "title": "Voyeur Kingdom",
        "description": "Inbox me! Submissions and questions about voyeur or anything in general are more than welcome",
        "url": "https://spyvoyeur4all.tumblr.com/",
        "updated": 1493029678
      },
      {
        "name": "cruising-gay",
        "title": "cruising gay",
        "description": "8=========D",
        "url": "https://cruising-gay.tumblr.com/",
        "updated": 1495896881
      }
    ]
  }
}